---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalService.ExternalServiceOptions
source: html/596bc66e-7d54-5ec2-f4f5-a049fc37c800.htm
---
# ExternalServiceOptions Properties

This property denotes a service as either public or private.